package com.lppz.ehr.util;

import org.slf4j.Logger;
import org.slf4j.LoggerFactory;

public class StringArrayUtil {
	
	private static Logger logger = LoggerFactory.getLogger(StringArrayUtil.class);
	
	public static boolean mobileContrast(String mobile){
		String[] strs = new String[]{
				"+86-18607113642",
//				"+86-13545010404",
//				"+86-15802727194",
//				"+86-15071126058",
//				"+86-18571467963",
//				"+86-18627873607",
//				"+86-13135676144",
//				"+86-15271288186",
//				"+86-13098849692",
//				"+86-15827079309",
//				"+86-15927297815",
//				"+86-15527866557",
//				"+86-18807188060",
//				"+86-15972908804",
//				"+86-18810406124",
//				"+86-18271489967",
//				"+86-15071102165",
//				"+86-13510086844",
//				"+86-18575321635",
//				"+86-13007103318",
//				"+86-13918127869",
//				"+86-15871758595",
//				"+86-17740695737",
//				"+86-18672303886",
//				"+86-15907137574",
//				"+86-13667250380",
//				"+86-17671451802",
//				"+86-15927340963",
//				"+86-15071235087",
//				"+86-18571501353",
//				"+86-15161478767",
//				"+86-15902758320",
//				"+86-18963944894",
//				"+86-15919454343",
//				"+86-15071066634",
//				"+86-15727007200",
//				"+86-17764005997",
//				"+86-18674039768",
//				"+86-13628677294",
//				"+86-13476275590",
//				"+86-13720230133",
//				"+86-13011265819",
//				"+86-15901986587",
//				"+86-13657262239",
//				"+86-13135699022",
//				"+86-15007187357",
//				"+86-17337181103",
//				"+86-13387576527",
//				"+86-15807159862",
//				"+86-18602750274",
				"+86-15007170791",
				"18971687223"
				
		};
//		List<String> list=Arrays.asList(strs);
//		boolean flag =list.contains(mobile);
		
		boolean flag = false;
		for(int i = 0; i< strs.length; i++){
			if(strs[i].indexOf(mobile)>-1){
				flag = true;
				break;
			}
		}
		
		if(flag){
			logger.info("手机号码数据匹配正常");
		}else{
			logger.info("手机号码数据匹配异常");
//			throw new InvalidArgumentException("sap用户数据号码不匹配");
		}
		return flag;
	}
	
	public static void main(String[] args) {
		System.out.println(mobileContrast("18971687223"));
	}

}
